<template>
  <div class="app-container">
    <el-dialog title="确认协议" :visible.sync="detailVisible" width="40%">
      <div class="box">
        <h1>授权云商会绑定微信公众号服务协议</h1>
        <div class="box-content">
          <p>欢迎您使用云商会提供的一键分发服务，请您在使用并发布有关信息前阅读并同意以下条款：</p>
          <p>1. 服务内容</p>
          <p>1.1 为节省您的运营成本，提升发文效率，更好地为您提供服务，在您授权绑定第三方平台账号（包括但不限于微信公众号、云商会号、头条号、爱奇艺号、小红书号、哔哩哔哩（bilibili）以及云商会现有及未来拓展支持的其他服务，以下统称“自媒体账号”）的前提下，并在授权的有效阶段，云商会平台会关联该自媒体账号，并支持同步内容到自媒体账号。</p>
          <p>1.2 云商会是一个中立的平台服务提供者，本协议项下仅向您提供该服务：同步内容到您授权的自媒体账号的。</p>
          <p>1.3 云商会的内容由您生产、独立运营并独立承担全部责任。云商会进行本协议约定的内容审核，但云商会不会、也不可能参与同步内容的生产审核和相关运营工作。</p>
          <p>1.4 您所发布之文章、信息等内容仅代表用户观点，不代表云商会赞成发布信息的内容和立场，于您言论引发的全部责任，由您自行承担，云商会不承担任何责任。</p>
          <p>1.5 您完全知悉并认可，基于双方合作效率提升的考虑，自您同意本协议或使用本服务时起，您此前已经从您的自媒体账号同步至云商会，或授权云商会同步分发内容至任何一方自媒体账号下，即视为已自始取得您真实有效的关于同步的授权。</p>
          <p>2. 使用规范</p>
          <p>2.1 您保证提供资料的真实、合法、有效性，具有独立的行为能力和责任能力，您承诺您是授权绑定账号和同步内容的合法权利人，或经过原始权利人的合法授权，可合法发布和使用本协议下同步的内容。您对本服务的使用不违反国家各项法律法规的规定。</p>
          <p>2.2 您确认知晓，云商会平台仅就您的内容在自媒体账号便捷发布提供技术支持。您在开通及使用自媒体账号，或您根据本协议发布在自媒体账号的内容引发的任何问题及法律纠纷，由您与自媒体账号平台协商处理，云商会不对此承担任何法律责任。云商会平台不就授权内容在自媒体账号展示向您支付任何费用或收益。您在同意接受自媒体账号平台的服务协议的各项约定下使用本服务。</p>
          <p>2.3 云商会将会对您使用本服务提交的各项资质信息进行初步审核，并根据本平台自身判断决定您是否通过审核要求可使用本平台服务。您理解并同意，云商会的审核仅限于形式审核，但不对您提交的资料的真实性、合法性进行保证。因您的行为导致与其他用户或第三方发生争议的，由您独立对外承担责任。</p>
          <p>2.4 云商会仅提供技术服务，不会对您的内容进行任何编辑、修改或调整。但如您的内容中含有第三方的推广信息、水印、商业标识等，您理解并同意平台有权不予展示。</p>
          <p>2.5 您可利用云商会提供的水印服务，为您的内容添加权利管理信息，保障您的合法著作权权利。</p>
          <p>2.6 您承诺云商会不会因为您提供技术服务而面临任何来自您或第三方发起的争议或纠纷追责，不会使云商会陷入不利地位，如有均由您独立负责解决，并保障云商会免除此由此产生的任何不利影响。如因此给云商会造成损失的，您应承担赔偿责任。</p>
          <p>3. 知识产权</p>
          <p>3.1 云商会自主开发并独立享有本运营平台及本服务的知识产权等合法权益，您仅可在本服务范围内进行使用；</p>
          <p>3.2 您享有发表内容的著作权。</p>
          <p>3.3 用户数据是指用户在云商会（管理后台、微信小程序、APP）等中产生的与用户相关的数据，包括但不限于用户提交的文字数据、图像数据、用户操作行为形成的数据等。“用户数据”的所有权及其他相关权利属于云商会，且是云商会的商业秘密，依法属于用户享有的相关权利除外。</p>
          <p>4. 法律责任</p>
          <p>4.1 您保证：您使用本服务及您的任何行为，不会侵犯任何人的合法权益等。因本服务产生的任何的争议、纠纷、责任等，以及您违反相关法律法规或本协议约定引发的任何后果，均由您独立承担责任、赔偿损失，与云商会无关。如侵害到云商会或他人权益的，您须自行承担全部责任和赔偿一切损失。</p>
          <p>4.2 若云商会自行发现或根据相关部门的信息、权利人的投诉等发现您可能存在侵犯他人合法权益情形的，云商会有权根据一般人的认识自己进行独立判断，以认定您是否存在侵犯他人合法权益情形，若云商会经过判断认为您存在侵犯他人合法权益情形的，云商会有权随时单方采取以下一项或多项措施：（1）立即更换、修改、删除侵犯他人合法权益的相关内容；（2）对存在侵犯他人合法权益的您进行封停操作；（3）追究您的法律责任；（4）将您的行为对外予以公告；（5）其他云商会认为适合的处理措施。</p>
          <p>4.3 您充分理解并同意因您违反本协议或相关法律法规的规定，导致或产生本平台或第三方主张的任何索赔、要求或损失，您应当独立承担责任，并保证云商会免于因此遭受任何损失；云商会因此遭受损失的，您应当向云商会承担全部赔偿责任，包括但不限于消除影响、恢复名誉、赔礼道歉，以及产生的罚款、赔偿金、诉讼费、律师费等。</p>
          <p>5. 免责</p>
          <p>5.1 如因系统维护或升级等而需暂停服务时，将事先公告。若因硬件故障、黑客攻击、政府行为、第三方服务原因或其它不可抗力而导致暂停服务，于暂停服务期间造成的一切不便与损失，云商会不负任何责任。由于云商会的调整导致信息丢失和/或其他结果的，云商会不承担任何责任。</p>
          <p>5.2 鉴于网络服务的特殊性，云商会会根据一键分发的整体运营情况或相关运营规范、规则等，可以随时变更、中止或终止部分或全部的服务。云商会将以通知、站内信、短信、更新协议或其他合理方式事先通知您，若由此给您造成损失的，您理解并同意放弃追究云商会的责任。</p>
          <p>6. 法律适用与争议管辖</p>
          <p>6.1 本协议的有效性、履行和与本协议及其修订本效力有关的所有事宜，将受中华人民共和国大陆法律管辖，任何争议仅适用中华人民共和国大陆法律。</p>
          <p>6.2 本协议签订地为中国北京市海淀区。因本协议所引起的与云商会或云商会的任何纠纷或争议，协议各方首先应友好协商解决，协商不成，双方同意应将争议提交至海南省海口市美兰区人民法院诉讼解决。</p>
          <p>7. 协议修改、终止</p>
          <p>7.1 云商会有权随时修改本协议的任何条款，一旦本协议的内容发生变动，云商会将会直接在网站上公布修改之后的协议内容，该公布行为视为云商会已经通知修改内容。云商会也可通过其他适当方式提示修改内容。</p>
          <p>7.2 如果不同意云商会对本协议相关条款所做的修改，您有权终止本协议。如果继续使用网络服务，则视为接受云商会对本协议相关条款所做的修改。</p>
          <p>7.3 如本协议或本服务因为任何原因终止的，对于您的账号中的全部数据或您因使用本服务而存储在云商会服务器中的数据等任何信息，云商会可将该等信息保留或删除，包括服务终止前您尚未完成的任何数据。</p>
          <p>7.4 如本协议或本服务因为任何原因终止的，您应自行处理好关于数据等信息的备份以及与您的用户之间的相关事项的处理等，数据信息备份及您相关事宜由您自行承担有关责任，云商会不承担任何责任。</p>
          <p>8. 其他</p>
          <p>8.1 通知及送达。您充分理解并同意，就有关本服务的任何通知可通过如下任一途径向您发送：在软件及网站发布一般通知；向您提供的电子邮件地址发送电子邮件；向您提供的移动通讯号码发送短信通知；向您供的通讯地址以平信形式寄送书面通知；向您委托的运营人员/商务人员发送通知；向您的账号发送站内信或私信；其他可合理送达至您的方式。前述通知自发布或发送之日即视为送达成功，您义务查收任何上述通知。</p>
          <p>8.2 可分割性。本协议中的任何条款无论因何种原因无效或不可执行，其应视为从本协议中被移除，本协议中的其余条款仍应保持有效并且具有完全的法律拘束力。</p>
          <p>8.3 非雇佣：您和云商会均是独立的主体，在任何情况下本协议不构成双方之间的代理、合伙、合营或雇佣关系。</p>
          <p>8.4 标题。本协议中的所有标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
          <p>感谢您的支持与理解！</p>
        </div>
      </div>
      <div class="btn">
        <el-button @click.native="close">取消</el-button>
        <el-button v-dbClick type="primary" @click="save">我已阅读并同意</el-button>
      </div>
    </el-dialog>
  </div>
</template>

<script>
export default {

  data() {
    return {
      detailVisible: false, // 开启表格

    }
  },
  methods: {
    // 打开
    open() {
      this.detailVisible = true
    },

    // 关闭
    close() {
      this.detailVisible = false
    },
    // 确定
    save() {
      this.$emit('save')
      this.close()
    },

  },
}
</script>
<style lang="scss" scoped>
.box{
  width: 100%;
  text-align: center;
  .box-content{
    max-height: 360px;
    overflow: auto;
    font-weight: 400;
    font-size: 16px;
    text-align: left;
    color: #222;
    line-height: 24px;
    padding-bottom: 10px;
  }
}
.btn{
  width: 100%;
  text-align: center;
  margin: 50px 0 20px 0;
}
</style>
