export const statisticsList = [
  { id: 7, title: '累计发布问卷', content: '截止到昨日24点，平台以及商协会，总共发布的问卷数量' },
  { id: 1, title: '平台发布问卷', content: '截止到昨日24点，平台发布的问卷数量' },
  { id: 5, title: '商协会发布问卷', content: '截止到昨日24点，商协会发布的问卷数量' },
  { id: 8, title: '累计回收答卷', content: '截止到昨日24点，回收的答卷总数' },
  { id: 2, title: '平台回收答卷', content: '截止到昨日24点，平台发布的问卷中，回收的答卷数量' },
  { id: 6, title: '商协会回收答卷', content: '截止到昨日24点，商协会发布的问卷中，回收的答卷数量' },
  { id: 3, title: '覆盖商协会', content: '截止到昨日24点，发布了问卷的商协会数量' },
  { id: 4, title: '覆盖人数', content: '截止到昨日24点，提交了答卷的用户数' },

]
